tutorials/incompressible/icoFoam/elbow_(original)/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

/*  nu: Kinetic viscosity
    in the form of: "parameter [dimension] value"
    here dimension is [m^2][s^-1]
*/
nu              [0 2 -1 0 0 0 0] 0.01;


// ************************************************************************* //
